import {
  Document,
  Page,
  Text,
  StyleSheet,
  Image,
  View,
  Font,
} from "@react-pdf/renderer";
import React from "react";

const styles = StyleSheet.create({
  text: {
    fontSize: 8,
    display: "flex",
    // flexWrap: "wrap",
  },
  finalPag: {
    // marginTop: "23px",
    display: "flex",
  },
});

const data = [
  {
    content:
      " १. प्रचलित धितोपत्र ऐन, नियम, विनियम, कार्यविधि तथा नेपाल राष्ट्र बैंक, बिमा समिति, नेपाल धितोपत्र बोर्ड, नेपाल स्टक एक्सचेन्ज लिमिटेड, सिडिएस एन्ड क्लियरिङ लिमिटेड लगायतका नियामक निकायले समय समयमा जारी गरेका निर्देशिका, परिपत्र र निर्देशन समेतलाई यसै सम्झौतामा उल्लेख भए सरह मानी सम्झौताका पक्षहरुले सोको पालना गर्न मञ्जुर गर्दछन् ।",
  },
  {
    content:
      "   २. दोस्रो पक्षले यस सम्झौता गर्दाको वखत वा यस भन्दा अघि प्रथम पक्षलाई दिएको सूचना, दोस्रो पक्षको ग्राहक परिचय विवरण (केवाइसी) मा भरेको विवरणमा कुनै फेरबदल भए, फेरबदल भएको ७ कार्य दिनभित्र प्रथम पक्षलाई जानकारी दिई आफ्नो पहिचान तथा खाताका विवरणहरु अद्यावधिक गराउन मञ्जुर गर्दछ ।",
  },
  {
    content:
      " ३. दोस्रो पक्ष धितोपत्रको कारोबार गर्न कानून बमोजिम अयोग्य ठहरिने कुनै अवस्था उत्पन्न भई कारवाहीमा परेमा, आर्थिक रुपमा टाट पल्टिएमा, विघटनमा गएमा, दामासाहीमा परेमा वा कर्जा सूचना केन्द्रको कालो सूचीमा परेमा वा अन्य कुनै कारणले कानूनत आर्थिक कारोवार गर्न असमर्थ भएमा प्रथम पक्षलाई तुरुन्त जानकारी दिन मञ्जुर गर्दछ ।",
  },
  {
    content:
      " ४. दोस्रो पक्षले यस सम्झौतामा उल्लेख गरेको वा ग्राहक परिचय विवरण (केवाइसी) मा उल्लेख भएको इमेल ठेगाना वा मोबाइल नम्बरमा दोस्रो पक्षले प्रयोग गर्ने युजरनेम तथा पासवर्ड प्रथम पक्षले उपलब्ध गराउने छ । प्रथम पक्षले उपलब्ध गराएको वा सो पश्चात दोस्रो पक्षले परिर्वतन गरेको युजरनेम वा पासवर्डकाे गोपनियता कायम गर्ने र आफ्नो नियन्त्रणमा राख्ने दायित्व दोस्रो पक्षको हुनेछ ।",
  },
  {
    content:
      " ५. दोश्रो पक्षले बिक्री कारोवार गर्दा मौज्दातमा धितोपत्र रहेको वा रहने कुनै एक हीतग्राही खाता प्रथम पक्षलाई उपलब्ध गराउने छ । उक्त खाता अन्य धितोपत्र कारोवार सदस्यलाइ दिने छैन । यदी एउटै खाता अन्य धितोपत्र कारोवार सदस्यलाई दिइ हुने जोखिको जिम्मेवारी दोश्रो पक्षले लिने छ ।",
  },
  {
    content:
      " ६. दोस्रो पक्षलाई दिइएको युजरनेमबाट भएगरेको सम्पूर्ण कारोबारहरुको दायित्व बहन गर्ने तथा सो को समयमा राफसाफ गर्ने जिम्मेवारी दोस्रो पक्षको हुनेछ ।",
  },
  {
    content:
      " ७. दोस्रो पक्षलाइ प्रदान गरीएको युजरनेमको प्रयोग गरी सिर्जना हुने दायित्व तथा सम्झौतारत पक्ष र नेप्से समेतको सम्पत्तिमा कुनै हानी नोक्सानी भएमा सो प्रति दोस्रो पक्ष जिम्मेवार हुनेछ ।",
  },
  {
    content:
      " ८. दोस्रो पक्षले आफ्नो युजरनेम प्रयोग गरी वा प्रथम पक्षलाई आदेश दिई बिक्री भएका धितोपत्रहरुको निर्देशन पूर्जी जारी गर्नुपर्ने दायित्व दोस्रो पक्षको हुनेछ । यसरी बिक्री भएको धितोपत्रको हस्तान्तरण दोस्रो पक्षले टि+१ को १२ बजे भित्र प्रथम पक्षको राफसाफ खातामा जम्मा गर्न नसकी उक्त कारोवारको राफसाफ हुन नसकेमा सो बाट सिर्जित सम्पूर्ण दायित्व दोस्रो पक्षले वहन गर्नुपर्नेछ ।",
  },
  {
    content:
      "९. दोस्रो पक्षले धितोपत्र बिक्री गरिसकेपछि सो धितोपत्रको आधार मूल्य प्रथम पक्षलाई राफसाफ समयको १ (एक) दिन पूर्व नै उपलब्ध गराउनु पर्नेछ । आधार मूल्य समयमा उपलव्ध नगराएमा, फर्जी वा गलत आधार मूल्यका कारण उत्पन्न हुने कानूनी तथा आर्थिक दायित्च वा हानी नोक्सानी दोस्रो पक्षले व्यहोर्नु पर्नेछ ।",
  },
  {
    content:
      " १०. दोस्रो पक्षले बिक्रि गरेको धितोपत्रको कारोबारमा लाग्‍ने कर, शुल्क, दस्तुर तथा अन्य प्रणालीगत शुल्कहरु तथा प्रथम पक्षले धितोपत्र खरीद बिक्री सम्वन्धमा थप सुविधा प्रदान गरेमा लाग्‍ने थप स्वीकृत दस्तुर कट्टा गरी बाँकी रकम मात्र प्रथम पक्षले दोस्रो पक्षलाई भुक्तानी गर्नेछ ।",
  },
  {
    content:
      " ११. दोस्रो पक्षले खरीद आदेश प्रणालीमा प्रविष्ट गर्दा प्रथम पक्षले तोकेको कारोबार लिमिटको सीमाभित्र रही गर्नु पर्नेछ । दोस्रो पक्षले प्रथम पक्षलाई अग्रिम रुपमा बुझाएको रकमको ४ (चार) गुणा सम्म कारोबार लिमिट प्राप्त गर्न सक्नेछ । उक्त कारोबार सीमा दोस्रो पक्षले बुझाएको रकमको चार गुणा भन्दा बढी हुनेछैन ।",
  },
  {
    content:
      " ११.१ दोस्रो पक्षले प्रथम पक्षलाई अग्रिम रुपमा बुझाएको रकमको दोस्रो पक्षले खरिद गर्ने धितोपत्रबाट सिर्जना हुने कुल दायित्व रकममा समायोजन हुनेछ।",
  },
  {
    content:
      " ११.२ दोश्रो पक्षले धितोपत्रखरिद गरेवापत सिर्जना हुने कुल दायित्व रकममा प्रथमपक्षलाई अग्रिम रुपमा बुझाएको रकम तथा दोस्रो पक्षले धितोपत्र बिक्री गरि प्रथमपक्षसंग भुक्तानी लिन बाकी भए सो समेत समायोजन गरि बाकी रहेको दायित्व रकम कारोबारको राफसाफ हुनु भन्दा पहिले प्रथमपक्षलाई दोस्रो पक्षले भुक्तानी गर्नुपर्नेछ।",
  },
  {
    content:
      " ११.३ दोस्रो पक्षले प्रथमपक्षलाई तिर्नु पर्ने रकम कारोबार राफसाफ हुनुपुर्व भुक्तानी गर्न नसकेमा दोस्रो पक्षको नाममा खरिद भएको धितोपत्र प्रथमपक्षले बिक्रि गर्न सक्नेछ। तर दोस्रो पक्षले प्रथमपक्षसंग रकम तिर्ने समय माग गरेमा प्रथमपक्षले आफ्नो अनुकुलता हेरी दोस्रो पक्षले खरिद गरेको धितोपत्रको रकम भुक्तानी गर्न निश्चित समय दिन सक्नेछ।",
  },
  {
    content:
      " ११.४ सर्त न ११.३ बमोजिम दोस्रो पक्षको कारोबार राफसाफ गर्न उपयोग भएको प्रथमपक्षको रकममा दोस्रो पक्षलाई दिएको थप निश्चित समयावधि सम्ममा दोस्रो पक्षले तिर्नुपर्ने बाकी रकम प्रथम पक्षलाई उपलब्ध नगराए सम्मको वा दोस्रो पक्षको धितोपत्र बिक्रि गरि प्रथम पक्षलाई रकम प्राप्त नभएसम्मको समयावधिमा प्रथम पक्षले व्यहोर्नु परेको वास्तविक लागत थप गरि हुन आउने दायित्व दोस्रो पक्षले प्रथम पक्षलाई भुक्तानी गर्नु पर्नेछ वा दोस्रो पक्षलाई प्रथम पक्षले दिनुपर्ने हिसाबमा कट्टा गर्न सक्नेछ।",
  },
  {
    content:
      " ११.५ दोस्रो पक्षले प्रथम पक्षलाई बुझाएको अग्रिम रकममा दोस्रो पक्षले खरिद गर्ने धितोपत्रको राफसाफ नभएसम्मको अवधिसम्म प्रथम पक्षको राफसाफ खातामा रहदा प्रथम पक्षले बैंकबाट प्राप्त गर्ने प्रतिफल (खुद ब्याज) दोस्रो दोस्रो पक्षबता माग भए आएमा फिर्ता दिन सक्नेछ।",
  },
  {
    content:
      " ११.६ प्रथम पक्षले दोस्रो पक्षसंग लिनु पर्ने दायित्व रकमको लागत गणना तथा निर्धारण गर्दा प्रथम पक्षले वाणिज्य बैंकबाट ऋण लिदा आफुले तिर्नु पर्ने ब्याजदरमा सेवा शुल्‍क वापत बार्सिक ....... प्रतिशत बिन्दुले लागत थप गरि दायित्व निर्धारण गरिनेछ।",
  },
  {
    content:
      "११.७ प्रथम पक्षले दोस्रो पक्षलाई धितोपत्र बिक्रि वापतको भुक्तानी दिनुपर्ने अवस्थामा काबु बाहिरको परिस्थिथि सिर्जना भै भुक्तानी रोकिन गएमा तत्कालिन समयमा वाणिज्य बैंकहरुले आफ्ना ग्राहकलाई बचत खातामा दिने ब्याज रकम थप गरि भुक्तानी रकम उपलब्द गराउने छ।",
  },
  {
    content:
      "१२. दोस्रो पक्षले कारोबार सीमाका लागि प्रथम पक्षलाई बुझाउने सबै किसिमका भुक्तानी चेक वा अन्य विद्युतीय माध्यमबाट गर्नुपर्नेछ ।",
  },
  {
    content:
      "१३. दोस्रो पक्षले कारोबार प्रयोजनका लागि प्रथम पक्षलाई उपलब्ध गराएको रकम तथा धितोपत्र कारोवार राफसाफ प्रयोजनमा मात्र प्रयोग गर्नुपर्नेछ ।",
  },
  {
    content:
      "१४. दुवै पक्षको आपसी सहमतिमा दोस्रो पक्षले प्रथम पक्षलाई यस्तो कारोबार सीमाको लागि आवश्यक अग्रिम भुक्तानी बैंक ग्यारेन्टी तथा कारोवारयोग्य धितोपत्रहरुको माध्यमबाट पनि गर्न सक्ने छ । यस्तो धरौटी दोश्रो पक्षले आफनो दायीत्व समयमा भुक्तानी नगरेमा प्रथम पक्षले दोस्रो पक्षलाई जानकारी दिई नगदमा परिणत गर्न सक्ने छ ।",
  },
  {
    content:
      "१५. कारोबार सीमा गणना प्रयोजनको लागि कारोबारयोग्य धितोपत्रको मूल्यांकन बजार मूल्यको बढीमा ७० प्रतिशत सम्म गर्न सकिने छ । धितोपत्र तथा धितोपत्र बजारमा हुने सम्भावित जोखिमलाई मध्यनजर गरी प्रथम पक्षले दोस्रो पक्षलाई उपलब्ध गराएको कारोबार सीमा दोस्रो पक्षलाई जानकारी गराई फेरबदल गर्न सक्नेछ ।",
  },
  {
    content:
      "१६. खरीद कारोबारपछि बाँकी रहेको रकम खरिद बिल बमोजिम दोस्रो पक्षले टि+२ भित्रमा प्रथम पक्षको खातामा जम्मा हुने गरी प्रथम पक्षलाई उपलब्ध गराउनु पर्नेछ । यसरी रकम उपलब्ध गराउदा अग्रिम भुक्तानी रकममा उपलब्ध गराएको भए सो रकम समायोजन गर्ने सुविधा दोस्रो पक्षलाई हुनेछ ।",
  },
  {
    content:
      "१७. खरिद कारोबार पश्चात दोस्रो पक्षले राफसाफ समय भित्रमा आफ्नो दायित्व पुरा नगरेमा टि+3 मा प्रथम पक्षले दोस्रो पक्षलाई जानकारी गराई दोस्रो पक्षकै नाममा खरिद गरिएको तथा जमानतमा लिइएको धितोपत्र बिक्री, वैक जमानतबाट रकम र सो को लागत बापतको सोधभर्ना र नपुग रकम कानून बमोजिम असुल उपर गरि लिन सक्नेछ ।",
  },
  {
    content:
      "१८. दोस्रो पक्षको धितोपत्र बिक्री गरि प्रथम पक्षको लेना रकम असुलउपर गरी रकम बाँकी रहेमा दोस्रो पक्षको अग्रिम भुक्तानी सम्मको रकम दोस्रो पक्षलाई फिर्ता गरी थप रकम बाँकी रहन गए धितोपत्र कारोबार सञ्चालन विनियमावली, २०७५ मा तोकिए बमोजिम हुनेछ ।",
  },
];

const UserAggrementTmsOnePdf = ({ userData, extraInfo }) => {
  // const { user } = userData;
  // const currentAddressDetails = userData?.addressDetails?.filter(
  //   (address) => address.addressType === "T"
  // );

  // const permanentAddressDetails = userData?.addressDetails?.filter(
  //   (address) => address.addressType === "P"
  // );

  // const bodDetails = userData && userData?.corporateBodDetails;
  return (
    <>
      <View style={[styles, { marginTop: "10px" }]}>
        <View
          style={[
            styles,
            { display: "flex", flexDirection: "column", gap: "4px" },
          ]}
        >
          <Text style={[styles.text, { textAlign: "center" }]}>
            (धितोपत्र कारोबार सञ्चालन विनियमावली २०७५ को विनियम १० संग
            सम्बन्धित)
          </Text>
          <Text style={[styles.text, { textAlign: "center" }]}>
            (कारोवार सदस्य र ग्राहक बिचको सम्झौतापत्र )
          </Text>
          <Text style={[styles.text, { textAlign: "center" }]}>
            कम्पनी रजिस्ट्रारको कार्यलयमा दर्ता भई नेपाल धितोपत्र बोर्डबाट
            धितोपत्र दलाल व्‍यवसायीको इजाजत प्राप्त गरी नेपाल स्टक एक्सचेञ्ज
            लिमिटेडको कारोबार सदस्य रहेको स्थित कार्यालय रहेको{"  "}
            {/* {orgData && orgData?.address} {"  "} मा रजिस्टर्ड कार्यालय भएको */}
            {"  "}
            {/* {orgData && " " + orgData?.name} {" "}(उप्रान्त प्रथम पक्ष भनिनेछ) */}
          </Text>
          <Text style={[styles.text, { textAlign: "center" }]}>तथा</Text>
          <Text style={[styles.text, { textAlign: "center" }]}>
            प्रथम पक्ष मार्फत धितोपत्रको कारोबार गर्न / अनलाईन सुबिधा प्रयोग
            गर्ने ग्राहक संकेत नम्बर .................. हितग्राही खाता न. {"  "}
            {/* {user?.dematNo ? user?.dematNo : "..............."} {"  "}रहेको */}
            प्रदेश{"  "}
            {/* {permanentAddressDetails?.[0]?.province
              ? permanentAddressDetails?.[0]?.province
              : "................"}{" "} */}
            जिल्ला{" "}
            {/* {permanentAddressDetails?.[0]?.district
              ? permanentAddressDetails?.[0]?.district
              : "....................."} */}
            गा.पा. /न.पा. /उ.प.न.पा.{" "}
            {/* {permanentAddressDetails?.[0]?.municipality
              ? permanentAddressDetails?.[0]?.municipality
              : "...................."}{" "} */}
            वडा{"  "}
            {/* {permanentAddressDetails?.[0]?.wordNo
              ? permanentAddressDetails?.[0]?.wordNo
              : "..................."}{" "} */}
            {"  "}स्थायी ठेगाना भई हाल{"  "}
            {/* {currentAddressDetails?.[0]?.tole
              ? currentAddressDetails?.[0]?.tole
              : "............."}{" "} */}
            स्थानमा बसोबास गर्ने श्री {"  "}{" "}
            {/* {bodDetails?.fcpGrandFatherName
              ? bodDetails?.fcpGrandFatherName
              : "................."}{" "} */}
            {"  "} को नाती/नातीनी बुहारी, श्री {"  "}{" "}
            {/* {bodDetails?.fcpFatherName
              ? bodDetails?.fcpFatherName
              : "................."}{" "} */}
            {"  "} को छोरा / छोरी वर्ष को श्री {"  "}{" "}
            {/* {bodDetails?.fcpName ? bodDetails?.fcpName : "................."}{" "} */}
            {"  "} वा ग्राहक संकेत नम्बर (युनिक क्लाईन्ट
            कोड)............................ रहेको ..........................
            कार्यालयमा दर्ता भई रजिस्टर्ड कार्यालय
            .............................. मा भएको श्री
            .........................................................................
            ले (उप्रान्त दोस्रो पक्ष भनिने र सो शब्दले विषय वा प्रसंगले अन्यथा
            अर्थ लगाएकोमा बाहेक निजका उत्तराधिकारी र / वा कानुनी प्रतिनिधि समेत
            लाई जनाउने), बीच नेप्सेको कारोबार प्रणालीबाट कारोबार हुने विधि र
            आफैले कारोबार गर्ने सम्बन्धमा दोस्रो पक्ष सँग आवश्यक ज्ञान रहेको
            मानी यो सम्झौता (उप्रान्त सम्झौता भनिने छ) सम्पन्न भएको छ ।
          </Text>
        </View>

        <View>
          <Text style={[styles.text, { margin: "12px 0 6px 0" }]}>
            यस सम्झौताका पक्षहरु निम्‍नलिखित शर्तहरु पालना गर्न मञ्जुर छन् :
          </Text>
          <View
            style={[
              styles,
              { display: "flex", flexDirection: "column", gap: "2px" },
            ]}
          >
            {data &&
              data?.map((label) => {
                return (
                  <Text key={label?.content} style={styles.text}>
                    {label?.content}
                  </Text>
                );
              })}
          </View>
        </View>
      </View>
    </>
  );
};

export default UserAggrementTmsOnePdf;
