import {
    Document,
    Page,
    Text,
    StyleSheet,
    Image,
    View,
    Font,
  } from "@react-pdf/renderer";
  import React from "react";  
  
  const styles = StyleSheet.create({
    headerText: {
      textAlign: "center",
      fontSize: "11px",
      padding: 4,
    },
    titleText: {
      fontSize: 10,
    },
    paragraphText: {
      fontSize: 8,
      display: "flex",
      flexWrap: "wrap",
      marginLeft: 10,
    },
    text: {
      fontSize: 8,
      display: "flex",
      flexWrap: "wrap",
    },
    finalPag: {
      marginTop: "23px",
      display: "flex",
    },
  });
  
  const data = [
    {
      content:
        "१९. दोस्रो पक्षले खरीद गरेको धितोपत्र खरिदबाट सिर्जित दायित्वहरु पुरा गरेपछि वा कारोवारको राफसाफको दिन मध्ये जुन पछी हुन्छ सो को भोलिपल्ट ग्राहकको निक्षेप खातामा प्रथम पक्षले धितोपत्र हस्तान्तरण गर्नु पर्नेछ ।",
    },
    {
      content:
        "२०. दोस्रो पक्षको नामवाट कारोवार भए पश्चात दोस्रो पक्षको मृत्यु भएमा, दामासाहीमा परेमा, मगज बिग्रिएमा वा अन्य कुनै कारणवाट दोस्रो पक्षको नामवाट भएका कारोवारको राफसाफ हुन नसक्ने स्थिति सिर्जना भएमा उक्त कारोबारको राफसाफको जिम्मेवारी निज वा निजको कानूनी उत्तराधिकारीको हुनेछ । कानुनी उत्तराधिकारीवाट पनि राफसाफ हुन नसकेमा प्रचलित कानून बमोजिम हुनेछ ।",
    },
    {
      content:
        "२१. नियामक निकायहरुबाट कारोबारहरु रद्द भएमा वा रद्द गर्ने आदेश प्राप्त भएमा सो कारोवारहरु स्वतः रद्द हुनेछन । सोको दायित्व प्रथम पक्षले बहन गर्ने छैन ।",
    },
    {
      content:
        " २२. दोस्रो पक्ष नावालक वा कानूनतः पक्षको रुपमा करार गर्न अयोग्य देखिएमा निजको संरक्षक वा प्रतिनिधिले यो सम्झौता गर्न सक्नेछ ।",
    },
    {
      content:
        " २३. प्रथम पक्षको काबु बाहिरको परिस्थितिको कारणबाट उत्पन्न हुने कुनै पनि दायित्वमा प्रथम पक्ष जिम्मेवार हुने छैन ।",
    },
    {
      content:
        " २४. दोस्रो पक्षले आफ्नो कारोवारको निम्ति आदेश दिन लिखित मञ्जुरी दिई प्रतिनिधि नियुक्ति गर्न सक्ने छ सो प्रतिनिधिवाट भएका सम्पूर्ण कारोबारहरु निज दोस्रो पक्षले नै गरेसरह मान्य हुनेछ ।",
    },
    {
      content:
        " २५. धितोपत्रमा गरीने लगानीमा जोखिम हुन्छ भन्ने कुरामा दोस्रो पक्ष जानकार रहेको मानिनेछ र सो जोखिमबाट सिर्जित हुने हानी नोक्सानी प्रति दोस्रो पक्षनै जिम्मेवार रहनेछ ।",
    },
  ];
  
  const newData = [
    {
      content:
        "२७. दोस्रो पक्षको मार्जिन कारोवार सुविधा उपयोग गर्ने भएमा सो सम्बन्धी सर्त तथा सुविधाहरु सम्बन्धित नियममा तोकिए बमोजिम हुनेछ ।",
    },
    {
      content:
        "२८. दोस्रो पक्षले धितोपत्र कारोवार गर्दा उक्त धितोपत्र कारोवार गर्न प्रचलित कानुन वमोजिम आफु योग्य रहेको र सोधितोपत्रमा आफुले कानून बमोजिम धारण गर्न सक्ने सीमा भित्र रहि खरीद आदेश प्रविष्ट गर्नु पर्ने छ । सो नगरेबाट सिर्जित परिणाम तथा दायित्व दोस्रो पक्षको हुनेछ ।",
    },
    {
      content:
        "२९. प्रचलित नीति नियममा उल्लेख भएअनुसार वा सम्बन्धित निकायहरुबाट धितोपत्रको कारोबारको श्रोतको जानकारी गराउन आवश्यक रहेमा उक्त जानकारी कारोबार राफसाफ समयाबधीभित्र प्रथम पक्षलाई बुझाउन दोस्रोपक्ष मञ्जुर गर्दछ । दोस्रो पक्षले प्रचलित कानुन बमोजिम अवैधानिक नठहरीने रकमहरु मात्र धितोपत्रमा लगानी गर्नुपर्ने छ ।",
    },
    {
      content:
        "३०. पक्षहरुबिच आपसि सहमतीमा एक महिनाको अग्रिम सूचना दिई यो सम्झौता रद्द गर्न सकिनेछ । सम्झौता रद्द गर्नु पूर्व पक्षहरुले आ–आफ्नो दायित्व पुरा गरेको हुनु पर्नेछ ।",
    },
    {
      content:
        " ३१. प्रचलित कानून बमोजिम प्रथम पक्षले व्यवसाय सञ्चालनका लागि प्राप्त गरेको इजाजत, अनुमतिपत्र, सदस्यता खारेज भइ कारोबार गर्न अयोग्य भएमा यो सम्झौता स्वतः खारेज हुनेछ । यसरी सम्झौता खारेज भए पनि बाँकी बक्यौता फछ्र्यौट गर्नुपर्ने दायित्व दुवै पक्षको हुनेछ ।",
    },
    {
      content:
        "३२. यस सम्झौताअनुसार प्रथम पक्षले दिने अथवा आवश्यक हुने कुनै पनि जनाउ वा सञ्‍चार तोकिएको माध्यमबाट दोस्रो पक्षको अद्यावधिक ठेगानामा पठाए पश्चात दोस्रो पक्षले जानकारी पाए सरह हुनेछ ।",
    },
    {
      content:
        "३३. सम्झौताका दुवै पक्षहरुले नेप्से अनलाइन कारोबार प्रणालीमा क्षति पर्याउने कुनै पनि कार्य गर्ने छैनन् ।",
    },
    {
      content:
        "३४. प्रथम पक्षले प्रचलित कानूनमा उल्लेख भएको अवस्थामा बाहेक दोस्रो पक्षको गोपनीयता कायम गर्नेछ ।",
    },
    {
      content:
        "३५. पक्षहरुका बीचमा उत्पन्न हुनसक्ने विवाद तथा मतभिन्नताहरुको समाधान सकेसम्म आपसी सहमतिमा निराकरण गरिनेछ । आपसी सहमतीबाट समाधान गर्न नसकेमा धितोपत्र कारोबार सञ्‍चालन विनियमावली, २०७५ मा तोकिए बमोजिम बमोजिम हुनेछ ।",
    },
    {
      content:
        "३६. दोस्रो पक्षले अनलाईन कारोबार सुविधा, एसएमएस सुबिधा लगायतका अन्य सुबिधा उपयोग गरे बापत तोकिएको शुल्क तिर्न मञ्जुर गर्दछ । दोस्रो पक्षले उल्लिखित सुबिधाहरु प्राप्त गर्न हरेक आर्थिक वर्षमा नविकरण शुल्क तिर्नुपर्नेछ ।",
    },
    {
      content:
        "३७. यो सम्झौतामा उल्लेख तथा व्याख्या नभएका विषय प्रचलित नेपाल कानूनद्वारा नियमन तथा व्याख्या हुनेछ ।",
    },
    {
      content:
        "३८. कारोबार राफसाफ चक्र तथा अन्य नियम कानुन तथा निर्देशन परिवर्तन भएमा परिवर्तनको हद सम्म यस सम्झौतामा लेखिएका शर्तहरु स्वतस् परिवर्तन हुनेछ।",
    },
    {
      content:
        "३९. यो सम्झौता दुवै पक्षले हस्ताक्षर गरेको मितिबाट .............................. सम्म कायम रहने छ र दुवै पक्षको सहमतीबाट सम्झौता पुनः नविकरण हुन सक्नेछ ।",
    },
    {
      content:
        "४०. यो सम्झौता राम्ररी पढी, बुझी दुवै पक्ष हस्ताक्षर गर्न मञ्जुर गर्दछौं ।",
    },
  ];
  
  const UserAgreementTmsTwoPdf = ({ userData, extraInfo }) => {
    // const { user } = userData;
  
    return (
      <>
        <View style={[styles, { marginTop: "18px" }]}>
          <View
            style={[
              styles,
              {
                display: "flex",
                flexDirection: "column",
                gap: "2px",
              },
            ]}
          >
            {data &&
              data.map((label) => {
                return (
                  <Text key={label?.content} style={[styles.text]}>
                    {label?.content}
                  </Text>
                );
              })}
            <Text style={styles.text}>
              २६. दोस्रो पक्षले निम्‍न लिखित माध्यमवाट कारोबार आदेश दिन सक्नेछ
            </Text>
            <View
              style={[
                styles,
                { display: "flex", flexDirection: "row", width: "100%" },
              ]}
            >
              <View
                style={[
                  styles,
                  {
                    display: "flex",
                    flexDirection: "column",
                    gap: "2px",
                    width: "50%",
                  },
                ]}
              >
                <Text style={styles.text}>क. स्वयं उपस्थित भई लिखित आदेश</Text>
                <Text style={styles.text}>
                  ग. मोबाइलफोन{"  "}
                  {/* {userData?.user?.phoneNo
                    ? user?.phoneNo
                    : "..................."} */}
                </Text>
                <Text style={styles.text}>
                  ङ. दोश्रो पक्ष्यको उजरनेम ...............................
                </Text>
                <Text style={styles.text}>
                  छ. अन्य बिद्युतीय माध्यम ...............................
                </Text>
              </View>
              <View
                style={[
                  styles,
                  {
                    display: "flex",
                    flexDirection: "column",
                    gap: "4px",
                    width: "50%",
                  },
                ]}
              >
                <Text style={styles.text}>
                  ख. टेलिफोन ...............................
                </Text>
                <Text style={styles.text}>
                  घ. इमेल{"  "}
                  {/* {userData?.user?.email
                    ? user?.email
                    : "..............................."} */}
                </Text>
                <Text style={styles.text}>
                  च. प्रथम पक्षको वेभसाइट ...............................
                </Text>
              </View>
            </View>
            <Text style={[styles.text, { marginTop: "4px" }]}>
              {" "}
              प्रथम पक्षले उल्लिखित माध्यमबाट आएका आदेशहरुलाई मात्र वैधानिक
              मान्यता दिई प्राथमिकताका आधारमा कारोबार प्रणालीमा आदेश प्रविष्टी
              गर्नेछ । नियम अनुसार उक्त आदेशहरुको सुरक्षित रेकर्डिङ्ग तथा भण्डारण
              प्रथम पक्षले गर्न सक्नेछ ।
            </Text>
          </View>
          <View
            style={[
              styles,
              {
                display: "flex",
                flexDirection: "column",
                gap: "2px",
                marginTop: "4px",
              },
            ]}
          >
            {newData &&
              newData.map((label) => {
                return (
                  <Text key={label?.content} style={[styles.text]}>
                    {label?.content}
                  </Text>
                );
              })}
          </View>
        </View>
      </>
    );
  };
  
  export default UserAgreementTmsTwoPdf;
  